ee230/C8051F/Examples/C8051F06x/Header_Files/C8051F060_defs.H
//-----------------------------------------------------------------------------
// C8051F060_defs.h
//-----------------------------------------------------------------------------
// Copyright 2008 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// Register/bit definitions for the C8051F06x/'F06x family.
// **Important Note**: The compiler_defs.h header file should be included
// before including this header file.
//
// Target:         C8051F06x, 'F06x
// Tool chain:     Keil
// Command Line:   None
//
// Release 1.4 - 22 July 2008 (ES)
//    -Corrected IP register bits
// Release 1.3
//    -29 FEB 2008
//    -Made compiler independant by AS
//    -Added 16-bit sfr definitions
//
//-----------------------------------------------------------------------------
// Header File Preprocessor Directive
//-----------------------------------------------------------------------------

#ifndef C8051F060_DEFS_H
#define C8051F060_DEFS_H

//-----------------------------------------------------------------------------
// Byte Registers
//-----------------------------------------------------------------------------

SFR(P0, 0x80);             // PORT 0 LATCH
SFR(SP, 0x81);             // STACK POINTER
SFR(DPL, 0x82);            // DATA POINTER LOW
SFR(DPH, 0x83);            // DATA POINTER HIGH
SFR(SFRPAGE, 0x84);        // SFR PAGE REGISTER
SFR(SFRNEXT, 0x85);        // SFR PAGE REGISTER
SFR(SFRLAST, 0x86);        // SFR PAGE STACK ACCESS REGISTER
SFR(PCON, 0x87);           // POWER CONTROL
SFR(CPT0CN, 0x88);         // COMPARATOR 0 CONTROL
SFR(CPT1CN, 0x88);         // COMPARATOR 1 CONTROL
SFR(CPT2CN, 0x88);         // COMPARATOR 2 CONTROL
SFR(TCON, 0x88);           // TIMER/COUNTER CONTROL
SFR(CPT0MD, 0x89);         // COMPARATOR 0 CONFIGURATION
SFR(CPT1MD, 0x89);         // COMPARATOR 1 CONFIGURATION
SFR(CPT2MD, 0x89);         // COMPARATOR 2 CONFIGURATION
SFR(TMOD, 0x89);           // TIMER/COUNTER MODE
SFR(OSCICN, 0x8A);         // INTERNAL OSCILLATOR CONTROL
SFR(TL0, 0x8A);            // TIMER/COUNTER 0 LOW
SFR(OSCICL, 0x8B);         // INTERNAL OSCILLATOR CALIBRATION
SFR(TL1, 0x8B);            // TIMER/COUNTER 1 LOW
SFR(OSCXCN, 0x8C);         // EXTERNAL OSCILLATOR CONTROL
SFR(TH0, 0x8C);            // TIMER/COUNTER 0 HIGH
SFR(TH1, 0x8D);            // TIMER/COUNTER 1 HIGH
SFR(CKCON, 0x8E);          // CLOCK CONTROL
SFR(PSCTL, 0x8F);          // PROGRAM STORE R/W CONTROL
SFR(P1, 0x90);             // PORT 1 LATCH
SFR(SSTA0, 0x91);          // UART 0 STATUS
SFR(SFRPGCN, 0x96);        // SFR PAGE CONTROL REGISTER
SFR(CLKSEL, 0x97);         // OSCILLATOR CLOCK SELECTION REGISTER
SFR(SCON0, 0x98);          // UART 0 CONTROL
SFR(SCON1, 0x98);          // UART 1 CONTROL
SFR(SBUF0, 0x99);          // UART 0 DATA BUFFER
SFR(SBUF1, 0x99);          // UART 1 DATA BUFFER
SFR(SPI0CFG, 0x9A);        // SPI CONFIGURATION
SFR(SPI0DAT, 0x9B);        // SPI DATA
SFR(P4MDOUT, 0x9C);        // PORT 4 OUTPUT MODE CONFIGURATION
SFR(P5MDOUT, 0x9D);        // PORT 5 OUTPUT MODE CONFIGURATION
SFR(SPI0CKR, 0x9D);        // SPI CLOCK RATE CONTROL
SFR(P6MDOUT, 0x9E);        // PORT 6 OUTPUT MODE CONFIGURATION
SFR(P7MDOUT, 0x9F);        // PORT 7 OUTPUT MODE CONFIGURATION
SFR(P2, 0xA0);             // PORT 2 LATCH
SFR(EMI0TC, 0xA1);         // EMIF TIMING CONTROL
SFR(EMI0CN, 0xA2);         // EMIF CONTROL
SFR(EMI0CF, 0xA3);         // EMIF CONFIGURATION
SFR(P0MDOUT, 0xA4);        // PORT 0 OUTPUT MODE CONFIGURATION
SFR(P1MDOUT, 0xA5);        // PORT 1 OUTPUT MODE CONFIGURATION
SFR(P2MDOUT, 0xA6);        // PORT 2 OUTPUT MODE CONFIGURATION
SFR(P3MDOUT, 0xA7);        // PORT 3 OUTPUT MODE CONFIGURATION
SFR(IE, 0xA8);             // INTERRUPT ENABLE
SFR(SADDR0, 0xA9);         // UART 0 SLAVE ADDRESS
SFR(P1MDIN, 0xAD);         // PORT 1 INPUT MODE
SFR(P2MDIN, 0xAE);         // PORT 2 INPUT MODE
SFR(P3, 0xB0);             // PORT 3 LATCH
SFR(FLACL, 0xB7);          // FLASH ACCESS LIMIT
SFR(FLSCL, 0xB7);          // FLASH SCALE
SFR(IP, 0xB8);             // INTERRUPT PRIORITY
SFR(SADEN0, 0xB9);         // UART 0 SLAVE ADDRESS ENABLE
SFR(ADC0CPT, 0xBA);        // ADC0 CALIBRATION POINTER
SFR(AMX2CF, 0xBA);         // ADC2 ANALOG MULTIPLEXER CONFIGURATION
SFR(ADC0CCF, 0xBB);        // ADC0 CALIBRATION COEFFICIENT
SFR(AMX0SL, 0xBB);         // ADC0 MULTIPLEXER CHANNEL SELECT
SFR(AMX2SL, 0xBB);         // ADC2 ANALOG MULTIPLEXER CHANNEL SELECT
SFR(ADC0CF, 0xBC);         // ADC0 CONFIGURATION
SFR(ADC1CF, 0xBC);         // ADC1 CONFIGURATION
SFR(ADC2CF, 0xBC);         // ADC2 CONFIGURATION
SFR(ADC0L, 0xBE);          // ADC0 DATA WORD LOW
SFR(ADC1L, 0xBE);          // ADC1 DATA WORD LOW
SFR(ADC2L, 0xBE);          // ADC2 DATA WORD LOW
SFR(ADC0H, 0xBF);          // ADC0 DATA WORD HIGH
SFR(ADC1H, 0xBF);          // ADC1 DATA WORD HIGH
SFR(ADC2H, 0xBF);          // ADC2 DATA WORD HIGH
SFR(CAN0STA, 0xC0);        // CAN0 STATUS
SFR(SMB0CN, 0xC0);         // SMBUS CONTROL
SFR(SMB0STA, 0xC1);        // SMBUS STATUS
SFR(SMB0DAT, 0xC2);        // SMBUS DATA
SFR(SMB0ADR, 0xC3);        // SMBUS SLAVE ADDRESS
SFR(ADC0GTL, 0xC4);        // ADC0 GREATER-THAN LOW
SFR(ADC2GTL, 0xC4);        // ADC2 GREATER-THAN LOW
SFR(ADC0GTH, 0xC5);        // ADC0 GREATER-THAN HIGH
SFR(ADC2GTH, 0xC5);        // ADC2 GREATER-THAN HIGH
SFR(ADC0LTL, 0xC6);        // ADC0 LESS-THAN LOW
SFR(ADC2LTL, 0xC6);        // ADC2 LESS-THAN LOW
SFR(ADC0LTH, 0xC7);        // ADC0 LESS-THAN HIGH
SFR(ADC2LTH, 0xC7);        // ADC2 LESS-THAN HIGH
SFR(P4, 0xC8);             // PORT 4 LATCH
SFR(TMR2CN, 0xC8);         // TIMER/COUNTER 2 CONTROL
SFR(TMR3CN, 0xC8);         // TIMER/COUNTER 3 CONTROL
SFR(TMR4CN, 0xC8);         // TIMER/COUNTER 4 CONTROL
SFR(TMR2CF, 0xC9);         // TIMER/COUNTER 2 CONFIGURATION
SFR(TMR3CF, 0xC9);         // TIMER/COUNTER 3 CONFIGURATION
SFR(TMR4CF, 0xC9);         // TIMER/COUNTER 4 CONFIGURATION
SFR(RCAP2L, 0xCA);         // TIMER/COUNTER 2 CAPTURE/RELOAD LOW
SFR(RCAP3L, 0xCA);         // TIMER/COUNTER 3 CAPTURE/RELOAD LOW
SFR(RCAP4L, 0xCA);         // TIMER/COUNTER 4 CAPTURE/RELOAD LOW
SFR(RCAP2H, 0xCB);         // TIMER/COUNTER 2 CAPTURE/RELOAD HIGH
SFR(RCAP3H, 0xCB);         // TIMER/COUNTER 3 CAPTURE/RELOAD HIGH
SFR(RCAP4H, 0xCB);         // TIMER/COUNTER 4 CAPTURE/RELOAD HIGH
SFR(TMR2L, 0xCC);          // TIMER/COUNTER 2 LOW
SFR(TMR3L, 0xCC);          // TIMER/COUNTER 3 LOW
SFR(TMR4L, 0xCC);          // TIMER/COUNTER 4 LOW
SFR(TMR2H, 0xCD);          // TIMER/COUNTER 2 HIGH
SFR(TMR3H, 0xCD);          // TIMER/COUNTER 3 HIGH
SFR(TMR4H, 0xCD);          // TIMER/COUNTER 4 HIGH
SFR(SMB0CR, 0xCF);         // SMBUS CLOCK RATE
SFR(PSW, 0xD0);            // PROGRAM STATUS WORD
SFR(REF0CN, 0xD1);         // VOLTAGE REFERENCE CONTROL 0
SFR(REF1CN, 0xD1);         // VOLTAGE REFERENCE CONTROL 1
SFR(REF2CN, 0xD1);         // VOLTAGE REFERENCE CONTROL 2
SFR(DAC0L, 0xD2);          // DAC0 LOW
SFR(DAC1L, 0xD2);          // DAC1 LOW
SFR(DAC0H, 0xD3);          // DAC0 HIGH
SFR(DAC1H, 0xD3);          // DAC1 HIGH
SFR(DAC0CN, 0xD4);         // DAC0 CONTROL
SFR(DAC1CN, 0xD4);         // DAC1 CONTROL
SFR(CAN0DATL, 0xD8);       // CAN0 DATA LOW
SFR(DMA0CN, 0xD8);         // DMA0 CONTROL
SFR(P5, 0xD8);             // PORT 5 LATCH
SFR(PCA0CN, 0xD8);         // PCA CONTROL
SFR(CAN0DATH, 0xD9);       // CAN0 DATA HIGH
SFR(DMA0DAL, 0xD9);        // DMA0 DATA ADDRESS BEGINNING LOW BYTE
SFR(PCA0MD, 0xD9);         // PCA MODE
SFR(CAN0ADR, 0xDA);        // CAN0 ADDRESS
SFR(DMA0DAH, 0xDA);        // DMA0 DATA ADDRESS BEGINNING HIGH BYTE
SFR(PCA0CPM0, 0xDA);       // PCA MODULE 0 MODE REGISTER
SFR(CAN0TST, 0xDB);        // CAN0 TEST
SFR(DMA0DSL, 0xDB);        // DMA0 DATA ADDRESS POINTER LOW BYTE
SFR(PCA0CPM1, 0xDB);       // PCA MODULE 1 MODE REGISTER
SFR(DMA0DSH, 0xDC);        // DMA0 DATA ADDRESS POINTER HIGH BYTE
SFR(PCA0CPM2, 0xDC);       // PCA MODULE 2 MODE REGISTER
SFR(DMA0IPT, 0xDD);        // DMA0 INSTRUCTION WRITE ADDRESS
SFR(PCA0CPM3, 0xDD);       // PCA MODULE 3 MODE REGISTER
SFR(DMA0IDT, 0xDE);        // DMA0 INSTRUCTION WRITE DATA
SFR(PCA0CPM4, 0xDE);       // PCA MODULE 4 MODE REGISTER
SFR(PCA0CPM5, 0xDF);       // PCA MODULE 5 MODE REGISTER
SFR(ACC, 0xE0);            // ACCUMULATOR
SFR(PCA0CPL5, 0xE1);       // PCA CAPTURE 5 LOW
SFR(XBR0, 0xE1);           // PORT I/O CROSSBAR CONTROL 0
SFR(PCA0CPH5, 0xE2);       // PCA CAPTURE 5 HIGH
SFR(XBR1, 0xE2);           // PORT I/O CROSSBAR CONTROL 1
SFR(XBR2, 0xE3);           // PORT I/O CROSSBAR CONTROL 2
SFR(XBR3, 0xE4);           // PORT I/O CROSSBAR CONTROL 3
SFR(EIE1, 0xE6);           // EXTENDED INTERRUPT ENABLE 1
SFR(EIE2, 0xE7);           // EXTENDED INTERRUPT ENABLE 2
SFR(ADC0CN, 0xE8);         // ADC0 CONTROL
SFR(ADC1CN, 0xE8);         // ADC1 CONTROL
SFR(ADC2CN, 0xE8);         // ADC2 CONTROL
SFR(P6, 0xE8);             // PORT 6 LATCH
SFR(PCA0CPL2, 0xE9);       // PCA CAPTURE 2 LOW
SFR(PCA0CPH2, 0xEA);       // PCA CAPTURE 2 HIGH
SFR(PCA0CPL3, 0xEB);       // PCA CAPTURE 3 LOW
SFR(PCA0CPH3, 0xEC);       // PCA CAPTURE 3 HIGH
SFR(PCA0CPL4, 0xED);       // PCA CAPTURE 4 LOW
SFR(PCA0CPH4, 0xEE);       // PCA CAPTURE 4 HIGH
SFR(RSTSRC, 0xEF);         // RESET SOURCE
SFR(B, 0xF0);              // B REGISTER
SFR(EIP1, 0xF6);           // EXTERNAL INTERRUPT PRIORITY 1
SFR(EIP2, 0xF7);           // EXTERNAL INTERRUPT PRIORITY 2
SFR(CAN0CN, 0xF8);         // CAN0 CONTROL
SFR(DMA0CF, 0xF8);         // DMA0 CONFIGURATION
SFR(P7, 0xF8);             // PORT 7 LATCH
SFR(SPI0CN, 0xF8);         // SPI CONTROL
SFR(DMA0CTL, 0xF9);        // DMA0 REPEAT COUNTER LIMIT LOW BYTE
SFR(PCA0L, 0xF9);          // PCA COUNTER LOW
SFR(DMA0CTH, 0xFA);        // DMA0 REPEAT COUNTER LIMIT HIGH BYTE
SFR(PCA0H, 0xFA);          // PCA COUNTER HIGH
SFR(DMA0CSL, 0xFB);        // DMA0 REPEAT COUNTER STATUS LOW BYTE
SFR(PCA0CPL0, 0xFB);       // PCA CAPTURE 0 LOW
SFR(DMA0CSH, 0xFC);        // DMA0 REPEAT COUNTER STATUS HIGH BYTE
SFR(PCA0CPH0, 0xFC);       // PCA CAPTURE 0 HIGH
SFR(DMA0BND, 0xFD);        // DMA0 INSTRUCTION BOUNDARY
SFR(PCA0CPL1, 0xFD);       // PCA CAPTURE 1 LOW
SFR(DMA0ISW, 0xFE);        // DMA0 INSTRUCTION STATUS
SFR(PCA0CPH1, 0xFE);       // PCA CAPTURE 1 HIGH
SFR(WDTCN, 0xFF);          // WATCHDOG TIMER CONTROL

