ee230/C8051F/Examples/C8051F06x/Header_Files/C8051F060_defs.H
// TMR3CN 0xC8
SBIT (TF3, SFR_TMR3CN, 7);     // TIMER 3 OVERFLOW FLAG
SBIT (EXF3, SFR_TMR3CN, 6);    // TIMER 3 EXTERNAL FLAG
                               // Bit5 Unused
                               // Bit4 Unused
SBIT (EXEN3, SFR_TMR3CN, 3);   // TIMER 3 EXTERNAL ENABLE FLAG
SBIT (TR3, SFR_TMR3CN, 2);     // TIMER 3 ON/OFF CONTROL
SBIT (CT3, SFR_TMR3CN, 1);     // TIMER 3 COUNTER SELECT
SBIT (CPRL3, SFR_TMR3CN, 0);   // TIMER 3 CAPTURE SELECT

// TMR4CN 0xC8
SBIT (TF4, SFR_TMR4CN, 7);     // TIMER 4 OVERFLOW FLAG
SBIT (EXF4, SFR_TMR4CN, 6);    // TIMER 4 EXTERNAL FLAG
                               // Bit5 Unused
                               // Bit4 Unused
SBIT (EXEN4, SFR_TMR4CN, 3);   // TIMER 4 EXTERNAL ENABLE FLAG
SBIT (TR4, SFR_TMR4CN, 2);     // TIMER 4 ON/OFF CONTROL
SBIT (CT4, SFR_TMR4CN, 1);     // TIMER 4 COUNTER SELECT
SBIT (CPRL4, SFR_TMR4CN, 0);   // TIMER 4 CAPTURE SELECT

// PSW 0xD0
SBIT(CY, SFR_PSW, 7);          // CARRY FLAG
SBIT(AC, SFR_PSW, 6);          // AUXILIARY CARRY FLAG
SBIT(F0, SFR_PSW, 5);          // USER FLAG 0
SBIT(RS1, SFR_PSW, 4);         // REGISTER BANK SELECT 1
SBIT(RS0, SFR_PSW, 3);         // REGISTER BANK SELECT 0
SBIT(OV, SFR_PSW, 2);          // OVERFLOW FLAG
SBIT(F1, SFR_PSW, 1);          // USER FLAG 1
SBIT(P, SFR_PSW, 0);           // ACCUMULATOR PARITY FLAG

// DMA0CN 0xD8
SBIT (DMA0EN, SFR_DMA0CN, 7);  // DMA 0 ENABLE
SBIT (DMA0INT, SFR_DMA0CN, 6); // DMA 0 OPERATIONS COMPLETE
SBIT (DMA0MD, SFR_DMA0CN, 5);  // DMA 0 MODE SELECT
SBIT (DMA0DE1, SFR_DMA0CN, 4); // ADC 0 DATA OVERFLOW ERROR
SBIT (DMA0DE0, SFR_DMA0CN, 3); // ADC 1 DATA OVERFLOW ERROR
SBIT (DMA0DOE, SFR_DMA0CN, 2); // DMA 0 DATA OVERFLOW WARNINGENABLE
SBIT (DMA0DO1, SFR_DMA0CN, 1); // ADC 0 DATA OVERFLOW WARNING
SBIT (DMA0DO0, SFR_DMA0CN, 0); // ADC 1 DATA OVERFLOW WARNING

// PCA0CN 0xD8
SBIT (CF, SFR_PCA0CN, 7);      // PCA 0 COUNTER OVERFLOW FLAG
SBIT (CR, SFR_PCA0CN, 6);      // PCA 0 COUNTER RUN CONTROL BIT
SBIT (CCF5, SFR_PCA0CN, 5);    // PCA 0 MODULE 5 INTERRUPT FLAG
SBIT (CCF4, SFR_PCA0CN, 4);    // PCA 0 MODULE 4 INTERRUPT FLAG
SBIT (CCF3, SFR_PCA0CN, 3);    // PCA 0 MODULE 3 INTERRUPT FLAG
SBIT (CCF2, SFR_PCA0CN, 2);    // PCA 0 MODULE 2 INTERRUPT FLAG
SBIT (CCF1, SFR_PCA0CN, 1);    // PCA 0 MODULE 1 INTERRUPT FLAG
SBIT (CCF0, SFR_PCA0CN, 0);    // PCA 0 MODULE 0 INTERRUPT FLAG

// ADC0CN 0xE8
SBIT (AD0EN, SFR_ADC0CN, 7);   // ADC 0 ENABLE
SBIT (AD0TM, SFR_ADC0CN, 6);   // ADC 0 TRACK MODE
SBIT (AD0INT, SFR_ADC0CN, 5);  // ADC 0 EOC INTERRUPT FLAG
SBIT (AD0BUSY, SFR_ADC0CN, 4); // ADC 0 BUSY FLAG
SBIT (AD0CM1, SFR_ADC0CN, 3);  // ADC 0 CONVERT START MODE BIT 1
SBIT (AD0CM0, SFR_ADC0CN, 2);  // ADC 0 CONVERT START MODE BIT 0
SBIT (AD0WINT, SFR_ADC0CN, 1); // ADC 0 WINDOW INTERRUPT FLAG
                               // Bit0 Unused

// ADC1CN 0xE8
SBIT (AD1EN, SFR_ADC1CN, 7);   // ADC 1 ENABLE
SBIT (AD1TM, SFR_ADC1CN, 6);   // ADC 1 TRACK MODE
SBIT (AD1INT, SFR_ADC1CN, 5);  // ADC 1 EOC INTERRUPT FLAG
SBIT (AD1BUSY, SFR_ADC1CN, 4); // ADC 1 BUSY FLAG
SBIT (AD1CM2, SFR_ADC1CN, 3);  // ADC 1 CONVERT START MODE BIT 2
SBIT (AD1CM1, SFR_ADC1CN, 2);  // ADC 1 CONVERT START MODE BIT 1
SBIT (AD1CM0, SFR_ADC1CN, 1);  // ADC 1 CONVERT START MODE BIT 0
                               // Bit0 Unused

// ADC2CN 0xE8
SBIT (AD2EN, SFR_ADC2CN, 7);   // ADC 2 ENABLE
SBIT (AD2TM, SFR_ADC2CN, 6);   // ADC 2 TRACK MODE
SBIT (AD2INT, SFR_ADC2CN, 5);  // ADC 2 EOC INTERRUPT FLAG
SBIT (AD2BUSY, SFR_ADC2CN, 4); // ADC 2 BUSY FLAG
SBIT (AD2CM1, SFR_ADC2CN, 3);  // ADC 2 CONVERT START MODE BIT 1
SBIT (AD2CM0, SFR_ADC2CN, 2);  // ADC 2 CONVERT START MODE BIT 0
SBIT (AD2WINT, SFR_ADC2CN, 1); // ADC 2 WINDOW INTERRUPT FLAG
SBIT (AD2LJST, SFR_ADC2CN, 0); // ADC 2 LEFT JUSTIFY DATA BIT

// DMA0CF 0xF8
SBIT (DMA0HLT, SFR_DMA0CF, 7); // DMA 0 HALT OFF-CHIP XRAM ENABLE
SBIT (DMA0XBY, SFR_DMA0CF, 6); // DMA 0 XRAM BUSY
                               // Bit5 Unused
                               // Bit4 Unused
SBIT (DMA0CIE, SFR_DMA0CF, 3); // DMA 0 COUNTER OVERFLOW ENABLE
SBIT (DMA0CI, SFR_DMA0CF, 2);  // DMA 0 COUNTER OVERFLOW
SBIT (DMA0EOE, SFR_DMA0CF, 1); // DMA 0 END OF OPERATION ENABLE
SBIT (DMA0EO, SFR_DMA0CF, 0);  // DMA 0 END OF OPERATION

// SPI0CN 0xF8
SBIT (SPIF, SFR_SPI0CN, 7);    // SPI 0 INTERRUPT FLAG
SBIT (WCOL, SFR_SPI0CN, 6);    // SPI 0 WRITE COLLISION FLAG
SBIT (MODF, SFR_SPI0CN, 5);    // SPI 0 MODE FAULT FLAG
SBIT (RXOVRN, SFR_SPI0CN, 4);  // SPI 0 RX OVERRUN FLAG
SBIT (NSSMD1, SFR_SPI0CN, 3);  // SPI 0 SLAVE SELECT MODE 1
SBIT (NSSMD0, SFR_SPI0CN, 2);  // SPI 0 SLAVE SELECT MODE 0
SBIT (TXBMT, SFR_SPI0CN, 1);   // SPI 0 TX BUFFER EMPTY FLAG
SBIT (SPIEN, SFR_SPI0CN, 0);   // SPI 0 SPI ENABLE


//-----------------------------------------------------------------------------
// SFR PAGE DEFINITIONS
//-----------------------------------------------------------------------------

#define CONFIG_PAGE       0x0F    // SYSTEM AND PORT CONFIGURATION PAGE
#define LEGACY_PAGE       0x00    // LEGACY SFR PAGE
#define TIMER01_PAGE      0x00    // TIMER 0 AND TIMER 1
#define CPT0_PAGE         0x01    // COMPARATOR 0
#define CPT1_PAGE         0x02    // COMPARATOR 1
#define CPT2_PAGE         0x03    // COMPARATOR 2
#define UART0_PAGE        0x00    // UART 0
#define UART1_PAGE        0x01    // UART 1
#define SPI0_PAGE         0x00    // SPI 0
#define EMI0_PAGE         0x00    // EXTERNAL MEMORY INTERFACE
#define ADC0_PAGE         0x00    // ADC 0
#define ADC1_PAGE         0x01    // ADC 1
#define ADC2_PAGE         0x02    // ADC 2
#define SMB0_PAGE         0x00    // SMBUS 0
#define TMR2_PAGE         0x00    // TIMER 2
#define TMR3_PAGE         0x01    // TIMER 3
#define TMR4_PAGE         0x02    // TIMER 4
#define DAC0_PAGE         0x00    // DAC 0
#define DAC1_PAGE         0x01    // DAC 1
#define PCA0_PAGE         0x00    // PCA 0
#define DMA0_PAGE         0x03    // DMA 0
#define CAN0_PAGE         0x01    // CAN 0

//-----------------------------------------------------------------------------
// Interrupt Priorities
//-----------------------------------------------------------------------------

#define INTERRUPT_INT0                 0  // External Interrupt 0
#define INTERRUPT_TIMER0               1  // Timer0 Overflow
#define INTERRUPT_INT1                 2  // External Interrupt 1
#define INTERRUPT_TIMER1               3  // Timer1 Overflow
#define INTERRUPT_UART0                4  // UART0 Interrupt
#define INTERRUPT_TIMER2               5  // Timer2 Overflow
#define INTERRUPT_SPI                  6  // SPI Interrupt
#define INTERRUPT_SMBUS                7  // SMBus Interrupt
#define INTERRUPT_ADC0_WINDOW          8  // ADC0 Window Comparison
#define INTERRUPT_PCA0                 9  // PCA0 Peripheral
#define INTERRUPT_COMPARATOR0         10  // Comparator0 Interrupt
#define INTERRUPT_COMPARATOR1         11  // Comparator1 Interrupt
#define INTERRUPT_COMPARATOR2         12  // Comparator2 Interrupt
#define INTERRUPT_ADC0_EOC            13  // ADC0 End of Conversion
#define INTERRUPT_TIMER3              14  // Timer3 Overflow
#define INTERRUPT_ADC1_EOC            15  // ADC0 End of Conversion
#define INTERRUPT_TIMER4              16  // Timer4 Overflow
#define INTERRUPT_ADC2_WINDOW         17  // ADC2 Window Comparison
#define INTERRUPT_ADC2_EOC            18  // ADC2 End of Conversion
#define INTERRUPT_CAN                 19  // CAN Interrupt
#define INTERRUPT_UART1               20  // UART1 Interrupt
#define INTERRUPT_DMA0                21  // DMA0 Interrupt

//-----------------------------------------------------------------------------
// Header File PreProcessor Directive
//-----------------------------------------------------------------------------

#endif                                 // #define C8051F060_DEFS_H

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------
